ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_TokenImpl.patch
--- parser/parser-z/src/main/java/net/sourceforge/czt/parser/util/TokenImpl.java	2022-07-24 10:53:44.136953300 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_TokenImpl.txt	2022-08-20 09:45:03.702543800 +1000
@@ -40,7 +40,7 @@
   @Override
   public Object getSpelling()
   {
-    return spelling_ != null ? spelling_ : token_.spelling();
+    return spelling_ == null ? spelling_ : token_.spelling();
   }
 
   @Override
