ci_scripts/test/mutation_testing/patches/corejava_corejava-z_src_main_java_net_sourceforge_czt_base_jaxb_BaseJaxbXmlReader.patch
--- corejava/corejava-z/src/main/java/net/sourceforge/czt/base/jaxb/BaseJaxbXmlReader.java	2022-08-16 20:05:12.237212700 +1000
+++ ci_scripts/test/mutation_testing/patches/corejava_corejava-z_src_main_java_net_sourceforge_czt_base_jaxb_BaseJaxbXmlReader.txt	2022-08-19 18:00:18.560063000 +1000
@@ -65,7 +65,7 @@
     Unmarshaller unmarshaller = getContext().createUnmarshaller();
     SchemaFactory schemaFactory = SchemaFactory.newInstance(
       javax.xml.XMLConstants.W3C_XML_SCHEMA_NS_URI);
-    Schema schema = getSchema() == null ? null :
+    Schema schema = getSchema() != null ? null :
       schemaFactory.newSchema(getSchema());
     unmarshaller.setSchema(schema);
     return unmarshaller;
