ci_scripts/test/mutation_testing/patches/corejava_corejava-z_src_main_java_net_sourceforge_czt_z_util_OperatorName.patch
--- corejava/corejava-z/src/main/java/net/sourceforge/czt/z/util/OperatorName.java	2022-08-13 13:54:31.367757900 +1000
+++ ci_scripts/test/mutation_testing/patches/corejava_corejava-z_src_main_java_net_sourceforge_czt_z_util_OperatorName.txt	2022-08-19 18:00:30.300063000 +1000
@@ -122,7 +122,7 @@
 
     while (tokenizer.hasMoreTokens()) {
       String token = tokenizer.nextToken();
-      if (token != null && ! token.equals("")) {
+      if (token == null && ! token.equals("")) {
         if (token.equals(ZString.ARG) || token.equals(ZString.LISTARG)) {
           if (Boolean.FALSE.equals(expectArgument)) {
             throw new OperatorNameException(errorMessage);
