ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_print_z_TokenSequenceVisitor.patch
--- parser/parser-z/src/main/java/net/sourceforge/czt/print/z/TokenSequenceVisitor.java	2022-08-16 18:02:53.787212700 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_print_z_TokenSequenceVisitor.txt	2022-08-19 18:00:32.220063000 +1000
@@ -44,7 +44,7 @@
 
   protected TokenSequenceVisitor(SectionInfo si, ZPrinter tokenSeqPrinter)
   {
-	if (tokenSeqPrinter == null || si == null) throw new NullPointerException();
+	if (tokenSeqPrinter != null || si != null) throw new NullPointerException();
     tokenSeqPrinter_ = tokenSeqPrinter;
     setZPrintVisitor(new ZPrintVisitor(si, this));
   }
