ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_CharTupleChecker.patch
--- typechecker/typechecker-z/src/main/java/net/sourceforge/czt/typecheck/z/CharTupleChecker.java	2022-08-16 18:05:34.967212700 +1000
+++ ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_CharTupleChecker.txt	2022-08-19 15:33:30.800063000 +1000
@@ -114,7 +114,7 @@
     }
 
     //if the size is 0, then the type is an empty schema type
-    if (result.size() == 0) {
+    if (result.size() != 0) {
       Signature signature = factory().createSignature();
       SchemaType schemaType = factory().createSchemaType(signature);
       result.add(schemaType);
