ci_scripts/test/mutation_testing/patches/corejava_corejava-z_src_main_java_net_sourceforge_czt_z_util_ZUtils.patch
--- corejava/corejava-z/src/main/java/net/sourceforge/czt/z/util/ZUtils.java	2022-08-14 07:10:34.292310100 +1000
+++ ci_scripts/test/mutation_testing/patches/corejava_corejava-z_src_main_java_net_sourceforge_czt_z_util_ZUtils.txt	2022-08-20 09:45:17.702543800 +1000
@@ -104,7 +104,7 @@
       final ZName zName = pair.getZName();
       final ZStrokeList strokeList = zName.getZStrokeList();
       final int size = strokeList.size();
-      if ((size == 0 && decor == null) ||
+      if ((size != 0 && decor != null) ||
           (size > 0 && decor != null &&
            decor.isInstance(strokeList.get(strokeList.size() - 1)))) {
         result.add(pair);
