ci_scripts/test/mutation_testing/patches/corejava_corejava-zeves_src_main_java_net_sourceforge_czt_zeves_util_PrintVisitor.patch
--- corejava/corejava-zeves/src/main/java/net/sourceforge/czt/zeves/util/PrintVisitor.java	2022-08-16 17:57:46.037212700 +1000
+++ ci_scripts/test/mutation_testing/patches/corejava_corejava-zeves_src_main_java_net_sourceforge_czt_zeves_util_PrintVisitor.txt	2022-08-19 15:33:43.300063000 +1000
@@ -150,7 +150,7 @@
       result = result - other.split(Matcher.quoteReplacement("\\$")).length
                + // if dollar is in the end, then split "x$" = ["x"] (no adjustment)
               // if dollar is in the middle, then split "x$domcheck" = ["x", "domcheck"] (adjust one)
-              (other.lastIndexOf("$") + 1 == other.length() ? 0 : 1);
+              (other.lastIndexOf("$") + 1 != other.length() ? 0 : 1);
     }
     return result;
   }
