ci_scripts/test/mutation_testing/patches/corejava_corejava-zeves_src_main_java_net_sourceforge_czt_zeves_util_ZEvesConcreteSyntaxDescriptionVisitor.patch
--- corejava/corejava-zeves/src/main/java/net/sourceforge/czt/zeves/util/ZEvesConcreteSyntaxDescriptionVisitor.java	2022-08-16 19:08:20.837212700 +1000
+++ ci_scripts/test/mutation_testing/patches/corejava_corejava-zeves_src_main_java_net_sourceforge_czt_zeves_util_ZEvesConcreteSyntaxDescriptionVisitor.txt	2022-08-19 18:00:23.460063000 +1000
@@ -53,7 +53,7 @@
   public String visitTerm(Term term)
   {
     ZEvesConcreteSyntaxSymbol symbol = term.accept(visitor_);
-    if (symbol != null) {
+    if (symbol == null) {
       String localized =
         ResourceBundle.getBundle(resourceName_).getString(symbol.toString());
       String name = term.accept(getNameVisitor());
