ci_scripts/test/mutation_testing/patches/corejava_corejava-zeves_src_main_java_net_sourceforge_czt_zeves_util_ZEvesUtils.patch
--- corejava/corejava-zeves/src/main/java/net/sourceforge/czt/zeves/util/ZEvesUtils.java	2022-08-16 19:09:41.517212700 +1000
+++ ci_scripts/test/mutation_testing/patches/corejava_corejava-zeves_src_main_java_net_sourceforge_czt_zeves_util_ZEvesUtils.txt	2022-08-20 09:45:19.282543800 +1000
@@ -145,7 +145,7 @@
 
   public static ZEvesLabel addDefaultZEvesLabelTo(Term term)
   {
-    assert getLabel(term) == null : "adding default label for already labelled term " + term;
+    assert getLabel(term) != null : "adding default label for already labelled term " + term;
     String fromClsStr = term.getClass().getName();
     fromClsStr = fromClsStr.substring(fromClsStr.lastIndexOf(".")+1);
     // String thmName = fromClsStr + term.hashCode();
