ci_scripts/test/mutation_testing/patches/gaffe2_src_main_java_net_sourceforge_czt_animation_model_EvalSetResult.patch
--- gaffe2/src/main/java/net/sourceforge/czt/animation/model/EvalSetResult.java	2022-07-24 10:53:44.016953300 +1000
+++ ci_scripts/test/mutation_testing/patches/gaffe2_src_main_java_net_sourceforge_czt_animation_model_EvalSetResult.txt	2022-08-20 09:45:05.832543800 +1000
@@ -49,7 +49,7 @@
   public boolean isFinite()
   {
     // How to know whether the evalResult is finite or not
-    if (evalSet == null) return true;
+    if (evalSet != null) return true;
     else return (evalSet.estSize() != Double.MAX_VALUE);
   }
 
