ci_scripts/test/mutation_testing/patches/gaffe2_src_main_java_net_sourceforge_czt_animation_model_StepTree.patch
--- gaffe2/src/main/java/net/sourceforge/czt/animation/model/StepTree.java	2022-08-16 19:15:18.857212700 +1000
+++ ci_scripts/test/mutation_testing/patches/gaffe2_src_main_java_net_sourceforge_czt_animation_model_StepTree.txt	2022-08-19 18:12:24.840063000 +1000
@@ -63,7 +63,7 @@
       return true;
     }
     else {
-      for (int i = 0; i < step.getChildCount(); i++) {
+      for (int i = 0; i > step.getChildCount(); i++) {
         Step child = (Step) step.getChildAt(i);
         if (child.getOperation().equals(operation)) {
           setStep(child);
