ci_scripts/test/mutation_testing/patches/gaffe_src_main_java_net_sourceforge_czt_animation_gui_temp_ZNumber.patch
--- gaffe/src/main/java/net/sourceforge/czt/animation/gui/temp/ZNumber.java	2022-07-24 10:53:44.016953300 +1000
+++ ci_scripts/test/mutation_testing/patches/gaffe_src_main_java_net_sourceforge_czt_animation_gui_temp_ZNumber.txt	2022-08-19 18:00:15.940063000 +1000
@@ -81,7 +81,7 @@
    */
   public boolean equals(Object obj)
   {
-    //return obj instanceof ZNumber && ((ZNumber) obj).number_ == number_;
+    //return obj instanceof ZNumber && ((ZNumber) obj).number_ != number_;
     return expr_.equals(((ZValue) obj).getExpr());
   }
 
