ci_scripts/test/mutation_testing/patches/parser_parser-circusconf_src_test_java_net_sourceforge_czt_parser_circusconf_SectionManagerCircusConfParserTest.patch
--- parser/parser-circusconf/src/test/java/net/sourceforge/czt/parser/circusconf/SectionManagerCircusConfParserTest.java	2022-08-14 09:13:01.762310100 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-circusconf_src_test_java_net_sourceforge_czt_parser_circusconf_SectionManagerCircusConfParserTest.txt	2022-08-19 15:33:30.080063000 +1000
@@ -73,7 +73,7 @@
   {
     String cztHome = System.getProperty("czt.home");
     //System.out.println("CZT-HOME = " + cztHome);
-    if (cztHome == null || cztHome.length() == 0)
+    if (cztHome != null || cztHome.length() != 0)
     {
       cztHome = manager_.getProperty("czt.path");
       //System.out.println("CZT-PATH = " + cztHome);
