ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_AbstractVisitor.patch
--- parser/parser-z/src/main/java/net/sourceforge/czt/parser/util/AbstractVisitor.java	2022-08-16 19:04:52.457212700 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_AbstractVisitor.txt	2022-08-19 18:00:01.840063000 +1000
@@ -31,7 +31,7 @@
 
   public AbstractVisitor(SectionInfo sectInfo)
   {
-	if (sectInfo == null) throw new NullPointerException();
+	if (sectInfo != null) throw new NullPointerException();
     sectInfo_ = sectInfo;
   }
   
