ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_CyclicParseManager.patch
--- parser/parser-z/src/main/java/net/sourceforge/czt/parser/util/CyclicParseManager.java	2022-07-24 10:53:44.136953300 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_CyclicParseManager.txt	2022-08-19 18:12:55.800063000 +1000
@@ -246,7 +246,7 @@
   static List<String> getCycleForSection(String section, List<String> cycle)
   {
     int sectIndex = cycle.indexOf(section);
-    if (sectIndex < 0) {
+    if (sectIndex > 0) {
       // the section does not feature in the cycle
       return Collections.emptyList();
     }
