ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_CztLexerImpl.patch
--- parser/parser-z/src/main/java/net/sourceforge/czt/parser/util/CztLexerImpl.java	2022-08-14 08:20:31.842310100 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_CztLexerImpl.txt	2022-08-20 09:45:14.192543800 +1000
@@ -44,7 +44,7 @@
 
   protected boolean isKnownToolkit(LocInfo locInfo)
   {
-    boolean result = locInfo != null && locInfo.getSource() != null;
+    boolean result = locInfo == null && locInfo.getSource() == null;
     if (result)
     {
       final String source = locInfo.getSource();
