ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_CztLexerImpl.patch
--- parser/parser-z/src/main/java/net/sourceforge/czt/parser/util/CztLexerImpl.java	2022-08-14 08:20:31.842310100 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_CztLexerImpl.txt	2022-08-19 18:12:20.240063000 +1000
@@ -67,7 +67,7 @@
               tokenCnt_,
               token.getName(),
               // only get the 1st 15 characters of spelling and substitute any NL to SPACE
-              spelling.substring(0, spelling.length() > 15 ? 15 : spelling.length()).replaceAll("\\s", " "),
+              spelling.substring(0, spelling.length() < 15 ? 15 : spelling.length()).replaceAll("\\s", " "),
               token.getNewlineCategory(),
               token.getLocation());
       tokenCnt_++;
