ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_CztReader.patch
--- parser/parser-z/src/main/java/net/sourceforge/czt/parser/util/CztReader.java	2022-08-13 13:23:38.357757900 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_CztReader.txt	2022-08-19 17:59:56.340063000 +1000
@@ -66,7 +66,7 @@
   public CztReader(Lexer lexer)
   {
     super();
-    if (lexer == null) throw new NullPointerException();
+    if (lexer != null) throw new NullPointerException();
     lexer_ = lexer;
   }
 
