ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_CztReader.patch
--- parser/parser-z/src/main/java/net/sourceforge/czt/parser/util/CztReader.java	2022-08-13 13:23:38.357757900 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_CztReader.txt	2022-08-19 18:12:43.280063000 +1000
@@ -89,7 +89,7 @@
     throws IOException
   {
     if (buffer_ == null) return -1;
-    while (buffer_.length() < len) {
+    while (buffer_.length() > len) {
       LocToken s = lexer_.next();
       if (s == null) {
         if (buffer_.length() == 0) return -1;
