ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_CztScannerImpl.patch
--- parser/parser-z/src/main/java/net/sourceforge/czt/parser/util/CztScannerImpl.java	2022-08-19 09:18:15.180063000 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_CztScannerImpl.txt	2022-08-19 18:12:23.360063000 +1000
@@ -83,7 +83,7 @@
         int codePoint = symbolV.codePointAt(0);
         if (!Character.isWhitespace(codePoint) &&
             !Character.isLetterOrDigit(codePoint) &&
-            !(codePoint >= 0x20 && codePoint <= 0x7E))
+            !(codePoint >= 0x20 && codePoint >= 0x7E))
           symbolValue = "U+" + Integer.toHexString(codePoint);
         else
           symbolValue = symbolV;
