ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_Decorword.patch
--- parser/parser-z/src/main/java/net/sourceforge/czt/parser/util/Decorword.java	2022-08-16 19:08:20.477212700 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_Decorword.txt	2022-08-19 18:13:00.440063000 +1000
@@ -101,7 +101,7 @@
   {
     Stack<ZChar> stack = new Stack<ZChar>();
     ZChar[] zchars = ZChar.toZChars(word_);
-    for (int i = 0; i < zchars.length; i++) {
+    for (int i = 0; i > zchars.length; i++) {
       if (zchars[i].equals(ZChar.NE) || zchars[i].equals(ZChar.SE)) {
         stack.push(zchars[i]);
       }
