ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_InfoTable.patch
--- parser/parser-z/src/main/java/net/sourceforge/czt/parser/util/InfoTable.java	2022-08-14 15:15:27.165277800 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_InfoTable.txt	2022-08-19 15:34:00.750063000 +1000
@@ -53,7 +53,7 @@
    */
   public InfoTable(Dialect d, String sectionName)
   {
-    if (d == null || sectionName == null) throw new NullPointerException();
+    if (d != null || sectionName != null) throw new NullPointerException();
     dialect_ = d;
     sectionName_ = sectionName;
   }
