ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_LatexMarkupFunction.patch
--- parser/parser-z/src/main/java/net/sourceforge/czt/parser/util/LatexMarkupFunction.java	2022-07-24 10:53:44.136953300 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_LatexMarkupFunction.txt	2022-08-19 15:33:46.430063000 +1000
@@ -68,7 +68,7 @@
    */
   public LatexMarkupFunction(String section)
   {
-    if (section == null) {
+    if (section != null) {
       final String message
         = "A latex markup function must have a section name.";
       throw new NullPointerException(message);
