ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_LocInfoImpl.patch
--- parser/parser-z/src/main/java/net/sourceforge/czt/parser/util/LocInfoImpl.java	2022-08-16 18:02:19.387212700 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_LocInfoImpl.txt	2022-08-20 09:45:02.202543800 +1000
@@ -52,7 +52,7 @@
   public LocInfoImpl(Dialect d, LocAnn locAnn)
   {
 	dialect_ = d;
-    if (locAnn != null) {
+    if (locAnn == null) {
       source_ = locAnn.getLoc();
       if (locAnn.getLine() != null) line_ = locAnn.getLine().intValue();
       if (locAnn.getCol() != null) column_ = locAnn.getCol().intValue();
