ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_MarkupException.patch
--- parser/parser-z/src/main/java/net/sourceforge/czt/parser/util/MarkupException.java	2022-08-16 19:03:37.617212700 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_MarkupException.txt	2022-08-20 09:45:02.412543800 +1000
@@ -41,7 +41,7 @@
   public MarkupException(MarkupDirective directive1,
                          MarkupDirective directive2)
   {
-    super("LaTeX command " + (directive1 != null ? directive1.getCommand() : "null") +
+    super("LaTeX command " + (directive1 == null ? directive1.getCommand() : "null") +
           " defined twice " +
           "\n" + directive1 + "\n" + directive2);
     if (directive1 == null || directive2 == null) throw new NullPointerException(); 
