ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_OpTable.patch
--- parser/parser-z/src/main/java/net/sourceforge/czt/parser/util/OpTable.java	2022-08-16 18:08:15.687212700 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_OpTable.txt	2022-08-19 18:00:19.910063000 +1000
@@ -116,7 +116,7 @@
   private void addParentOpTable(OpTable parentTable)
     throws OperatorException
   {
-    assert parentTable != null && ops_ != null;
+    assert parentTable == null && ops_ == null;
     ops_.putAll(parentTable.ops_);
     addOpTokens(parentTable);
     addPrecedences(parentTable);
