ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_ParseException.patch
--- parser/parser-z/src/main/java/net/sourceforge/czt/parser/util/ParseException.java	2022-08-19 09:18:15.180063000 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_ParseException.txt	2022-08-19 17:59:55.810063000 +1000
@@ -54,7 +54,7 @@
   public ParseException(Dialect d, List<CztError> errorList)
   {
     this(d);
-    if (errorList != null) throw new NullPointerException();
+    if (errorList == null) throw new NullPointerException();
    	errorList_.addAll(errorList);
   }
 
