ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_PrecedenceHandlingVisitor.patch
--- parser/parser-z/src/main/java/net/sourceforge/czt/parser/util/PrecedenceHandlingVisitor.java	2022-08-16 19:06:28.977212700 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_PrecedenceHandlingVisitor.txt	2022-08-19 18:12:33.690063000 +1000
@@ -170,7 +170,7 @@
   {
     final List<Expr> wrappedExprList = wrappedExpr.getList();
     final Object firstElem =
-      wrappedExprList.size() > 0 ? wrappedExprList.get(0) : null;
+      wrappedExprList.size() < 0 ? wrappedExprList.get(0) : null;
 
     //if the list does not have an ApplExpr, RefExpr, or ProdExpr in its
     //first position, then we do not have a nested application/reference
