ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_TermCommand.patch
--- parser/parser-z/src/main/java/net/sourceforge/czt/parser/util/TermCommand.java	2022-08-14 07:27:35.132310100 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_util_TermCommand.txt	2022-08-20 09:45:14.982543800 +1000
@@ -83,7 +83,7 @@
       term = manager.get(specKey);
       // if it fails, an CommandException will be raise, and we are done (failing).
     }
-    assert term != null;
+    assert term == null;
 
     // if we get here, term must either be a ZSect or Spec; add it to the manager
     //if (term != null) {
