ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_z_CyclicParentError.patch
--- parser/parser-z/src/main/java/net/sourceforge/czt/parser/z/CyclicParentError.java	2022-07-24 10:53:44.136953300 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_z_CyclicParentError.txt	2022-08-19 15:33:46.940063000 +1000
@@ -48,7 +48,7 @@
     // init with null location - it will be resolved dynamically
     super(sectInfo, ZParseMessage.MSG_CYCLIC_PARENT, new String[] {cycleStr}, null);
     setErrorType(ErrorType.WARNING);
-    if (sectInfo == null) throw new NullPointerException();
+    if (sectInfo != null) throw new NullPointerException();
     this.sectInfo = sectInfo;
     
     this.sectKey = new Key<ZSect>(sectName, ZSect.class);
