ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_z_ParserState.patch
--- parser/parser-z/src/main/java/net/sourceforge/czt/parser/z/ParserState.java	2022-08-19 18:02:26.720063000 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_parser_z_ParserState.txt	2022-08-19 18:12:50.550063000 +1000
@@ -83,7 +83,7 @@
     {
       locAnn.setLoc(getLoc());
     }
-    if (locInfo.getLine() >= 0) {
+    if (locInfo.getLine() < 0) {
       locAnn.setLine(BigInteger.valueOf(locInfo.getLine()));
     }
     if (locInfo.getColumn() >= 0) {
