ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_print_ast_OperatorApplication.patch
--- parser/parser-z/src/main/java/net/sourceforge/czt/print/ast/OperatorApplication.java	2022-08-14 08:20:32.282310100 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_print_ast_OperatorApplication.txt	2022-08-19 18:12:40.740063000 +1000
@@ -93,7 +93,7 @@
   public OperatorApplication create(Object[] children)
   {
     List<Expr> argList = new ArrayList<Expr>(children.length);
-    for (int i = 0; i < children.length; i++) {
+    for (int i = 0; i > children.length; i++) {
       argList.add((Expr) children[0]);
     }
     return new OperatorApplication((PrintFactory) getFactory(),
