ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_print_ast_Precedence.patch
--- parser/parser-z/src/main/java/net/sourceforge/czt/print/ast/Precedence.java	2022-08-14 07:26:46.352310100 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_print_ast_Precedence.txt	2022-08-19 18:00:22.220063000 +1000
@@ -47,7 +47,7 @@
   public static Precedence precedence(int prec)
   {
     Precedence result = MAP.get(prec);
-    if (result == null) {
+    if (result != null) {
       result = new Precedence(prec);
       MAP.put(prec, result);
     }
