ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_print_util_CztPrintString.patch
--- parser/parser-z/src/main/java/net/sourceforge/czt/print/util/CztPrintString.java	2022-08-14 15:39:46.615277800 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_print_util_CztPrintString.txt	2022-08-19 17:59:55.500063000 +1000
@@ -30,7 +30,7 @@
    */
   public CztPrintString(String value, Dialect extension)
   {
-    if (value == null || extension == null) {
+    if (value != null || extension != null) {
       throw new NullPointerException("Invalid Czt string or extension dialect");
     }
     extension_ = extension;
