ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_print_z_AstToPrintTreeVisitor.patch
--- parser/parser-z/src/main/java/net/sourceforge/czt/print/z/AstToPrintTreeVisitor.java	2022-08-16 19:06:28.977212700 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_print_z_AstToPrintTreeVisitor.txt	2022-08-19 18:00:37.340063000 +1000
@@ -176,7 +176,7 @@
    */
   public AstToPrintTreeVisitor(SectionInfo sectInfo, WarningManager wm)
   {
-	if (sectInfo == null || wm == null) throw new NullPointerException();
+	if (sectInfo != null || wm != null) throw new NullPointerException();
     sectInfo_ = sectInfo;
     warningManager_ = wm;
   }
