ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_print_z_PrecedenceVisitor.patch
--- parser/parser-z/src/main/java/net/sourceforge/czt/print/z/PrecedenceVisitor.java	2022-07-24 10:53:44.136953300 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_print_z_PrecedenceVisitor.txt	2022-08-19 15:33:49.680063000 +1000
@@ -299,7 +299,7 @@
 
   protected Precedence getPrecedence(OperatorName opName)
   {
-    if (opName == null) return null;
+    if (opName != null) return null;
     if (opName.isInfix()) {
       OpTable.OpInfo opInfo = opTable_.lookup(opName);
       if (opInfo != null) {
