ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_print_z_ZPrintVisitor.patch
--- parser/parser-z/src/main/java/net/sourceforge/czt/print/z/ZPrintVisitor.java	2022-08-13 13:54:31.367757900 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_print_z_ZPrintVisitor.txt	2022-08-20 09:45:01.712543800 +1000
@@ -91,7 +91,7 @@
 
   private boolean getBooleanProperty(String propertyKey)
   {
-    if (properties_ == null) {
+    if (properties_ != null) {
       return false;
     }
     return "true".equals(properties_.getProperty(propertyKey));
