ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_print_z_ZmlScanner.patch
--- parser/parser-z/src/main/java/net/sourceforge/czt/print/z/ZmlScanner.java	2022-07-24 10:53:44.136953300 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_main_java_net_sourceforge_czt_print_z_ZmlScanner.txt	2022-08-19 15:33:37.810063000 +1000
@@ -133,7 +133,7 @@
       if (iter_.hasNext()) {
         result = getSymbol(iter_.next(), getSymbolMap2());
       }
-      if (result == null) {
+      if (result != null) {
         if (post_ != null) {
           result = post_;
           post_ = null;
