ci_scripts/test/mutation_testing/patches/parser_parser-z_src_test_java_net_sourceforge_czt_parser_Examples.patch
--- parser/parser-z/src/test/java/net/sourceforge/czt/parser/Examples.java	2022-08-14 15:15:27.165277800 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_test_java_net_sourceforge_czt_parser_Examples.txt	2022-08-19 15:33:44.640063000 +1000
@@ -43,7 +43,7 @@
   public static URL getExample(String name)
   {
     URL result = Resources.getZExample(name);
-    if (result == null) {
+    if (result != null) {
       throw new CztException("Cannot find example " + name);
     }
     return result;
