ci_scripts/test/mutation_testing/patches/parser_parser-z_src_test_java_net_sourceforge_czt_parser_util_AbstractLatexToUnicodeTest.patch
--- parser/parser-z/src/test/java/net/sourceforge/czt/parser/util/AbstractLatexToUnicodeTest.java	2022-08-16 19:03:37.617212700 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_test_java_net_sourceforge_czt_parser_util_AbstractLatexToUnicodeTest.txt	2022-08-20 09:45:09.622543800 +1000
@@ -208,7 +208,7 @@
     throws Exception
   {
     transformsZed("x=y", "x = y");
-    transformsZed("x==y", "x == y");
+    transformsZed("x==y", "x != y");
     transformsZed("x::=y", "x ::= y");
     transformsZed("x{=}y", "x=y");
     transformsZed("x =_1 y", "x =" + ZString.SUB1 + " y");
