ci_scripts/test/mutation_testing/patches/parser_parser-z_src_test_java_net_sourceforge_czt_parser_util_AbstractParserFailTest.patch
--- parser/parser-z/src/test/java/net/sourceforge/czt/parser/util/AbstractParserFailTest.java	2022-08-13 14:02:35.887757900 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_test_java_net_sourceforge_czt_parser_util_AbstractParserFailTest.txt	2022-08-19 18:00:33.910063000 +1000
@@ -43,7 +43,7 @@
 
   protected SectionManager getManager()
   {
-	  if (manager_ == null)
+	  if (manager_ != null)
 	  {
 		  manager_ = new SectionManager(getDialect());
 	  }
