ci_scripts/test/mutation_testing/patches/parser_parser-z_src_test_java_net_sourceforge_czt_parser_util_AbstractParserTest.patch
--- parser/parser-z/src/test/java/net/sourceforge/czt/parser/util/AbstractParserTest.java	2022-08-19 09:18:15.180063000 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_test_java_net_sourceforge_czt_parser_util_AbstractParserTest.txt	2022-08-19 18:00:30.420063000 +1000
@@ -48,7 +48,7 @@
 
   protected SectionManager getManager()
   {
-	  if (manager_ != null)
+	  if (manager_ == null)
 	  {
 		  manager_ = new SectionManager(getDialect());
 	  }
