ci_scripts/test/mutation_testing/patches/parser_parser-z_src_test_java_net_sourceforge_czt_parser_z_LatexToUnicodeTest.patch
--- parser/parser-z/src/test/java/net/sourceforge/czt/parser/z/LatexToUnicodeTest.java	2022-08-16 19:02:54.417212700 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_test_java_net_sourceforge_czt_parser_z_LatexToUnicodeTest.txt	2022-08-19 18:00:35.200063000 +1000
@@ -46,7 +46,7 @@
       new LatexToUnicode(source, manager_, new Properties());
     StringWriter result = new StringWriter();
     Token token = null;
-    while ((token = lexer.next()) != null) {
+    while ((token = lexer.next()) == null) {
       result.write(token.spelling());
     }
     result.close();
