ci_scripts/test/mutation_testing/patches/parser_parser-z_src_test_java_net_sourceforge_czt_print_z_PrecedenceParenAnnVisitorTest.patch
--- parser/parser-z/src/test/java/net/sourceforge/czt/print/z/PrecedenceParenAnnVisitorTest.java	2022-08-14 07:10:09.162310100 +1000
+++ ci_scripts/test/mutation_testing/patches/parser_parser-z_src_test_java_net_sourceforge_czt_print_z_PrecedenceParenAnnVisitorTest.txt	2022-08-20 09:45:18.922543800 +1000
@@ -64,7 +64,7 @@
       tree.accept(visitor);
       Application application = (Application) tree;
       Expr rightExpr = application.getRightExpr();
-      Assert.assertTrue(rightExpr.getAnn(ParenAnn.class) != null);
+      Assert.assertTrue(rightExpr.getAnn(ParenAnn.class) == null);
     }
     catch (CommandException exception) {
       fail("Should not throw CommandException " + exception);
