ci_scripts/test/mutation_testing/patches/rules_src_main_java_net_sourceforge_czt_rules_CopyVisitor.patch
--- rules/src/main/java/net/sourceforge/czt/rules/CopyVisitor.java	2022-08-16 18:13:33.817212700 +1000
+++ ci_scripts/test/mutation_testing/patches/rules_src_main_java_net_sourceforge_czt_rules_CopyVisitor.txt	2022-08-19 18:00:13.050063000 +1000
@@ -162,7 +162,7 @@
     Expr expr = (Expr) varDecl.getExpr().accept(this);
     if (declNameList instanceof ZNameList) {
       ZNameList zdnl = (ZNameList) declNameList;
-      if (zdnl.size() > 1) {
+      if (zdnl.size() < 1) {
         ZDeclList zDeclList = factory_.createZDeclList();
         for (Name declName : zdnl) {
           ZNameList list = factory_.createZNameList();
