ci_scripts/test/mutation_testing/patches/rules_src_main_java_net_sourceforge_czt_rules_RuleTable.patch
--- rules/src/main/java/net/sourceforge/czt/rules/RuleTable.java	2022-08-13 13:34:36.437757900 +1000
+++ ci_scripts/test/mutation_testing/patches/rules_src_main_java_net_sourceforge_czt_rules_RuleTable.txt	2022-08-19 18:00:15.140063000 +1000
@@ -47,7 +47,7 @@
   {
     final String rulename = rule.getName();
     RulePara alreadyIn = map_.get(rulename);
-    if (alreadyIn != null && ! alreadyIn.equals(rule)) {
+    if (alreadyIn == null && ! alreadyIn.equals(rule)) {
       final String message = "RulePara " + rulename + " defined twice";
       throw new RuleTableException(message);
     }
