ci_scripts/test/mutation_testing/patches/rules_src_main_java_net_sourceforge_czt_rules_oracles_LookupOracle.patch
--- rules/src/main/java/net/sourceforge/czt/rules/oracles/LookupOracle.java	2022-08-14 07:26:46.352310100 +1000
+++ ci_scripts/test/mutation_testing/patches/rules_src_main_java_net_sourceforge_czt_rules_oracles_LookupOracle.txt	2022-08-19 18:00:30.770063000 +1000
@@ -54,7 +54,7 @@
     catch (CommandException e) {
       table = null;
     }
-    if (table != null) {
+    if (table == null) {
       Factory factory = new Factory(new ProverFactory());
       CopyVisitor copyVisitor = new CopyVisitor(factory);
       RefExpr ref = (RefExpr) ProverUtils.removeJoker((Term) args.get(0));
