ci_scripts/test/mutation_testing/patches/rules_src_main_java_net_sourceforge_czt_rules_oracles_LookupOracle.patch
--- rules/src/main/java/net/sourceforge/czt/rules/oracles/LookupOracle.java	2022-08-14 07:26:46.352310100 +1000
+++ ci_scripts/test/mutation_testing/patches/rules_src_main_java_net_sourceforge_czt_rules_oracles_LookupOracle.txt	2022-08-19 15:33:45.010063000 +1000
@@ -73,7 +73,7 @@
         copyVisitor.setGeneralize("", null);  // finish generalizing
         Set<Binding> bindings = UnificationUtils.unify(defrhs, rightExpr);
         ZExprList actuals = ref.getZExprList();
-        if (bindings == null | formals.size() != actuals.size()) {
+        if (bindings != null | formals.size() != actuals.size()) {
           return null;
         }
         else {
