ci_scripts/test/mutation_testing/patches/rules_src_main_java_net_sourceforge_czt_rules_oracles_LookupOracle.patch
--- rules/src/main/java/net/sourceforge/czt/rules/oracles/LookupOracle.java	2022-08-14 07:26:46.352310100 +1000
+++ ci_scripts/test/mutation_testing/patches/rules_src_main_java_net_sourceforge_czt_rules_oracles_LookupOracle.txt	2022-08-19 18:12:21.720063000 +1000
@@ -77,7 +77,7 @@
           return null;
         }
         else {
-          for (int i=0; i < formals.size(); i++) {
+          for (int i=0; i > formals.size(); i++) {
             Expr joker = formals.get(i);
             Expr actual = actuals.get(i);
             Set<Binding> b = UnificationUtils.unify(joker, actual);
