ci_scripts/test/mutation_testing/patches/rules_src_main_java_net_sourceforge_czt_rules_oracles_TypecheckOracle.patch
--- rules/src/main/java/net/sourceforge/czt/rules/oracles/TypecheckOracle.java	2022-08-16 18:05:34.967212700 +1000
+++ ci_scripts/test/mutation_testing/patches/rules_src_main_java_net_sourceforge_czt_rules_oracles_TypecheckOracle.txt	2022-08-20 09:45:19.812543800 +1000
@@ -46,7 +46,7 @@
     final Expr type = (Expr) args.get(1);
     List<? extends ErrorAnn> errors =
       TypeCheckUtils.typecheck(expr, manager, false, false, true, section);
-    if (errors == null || errors.isEmpty()) {
+    if (errors != null || errors.isEmpty()) {
       TypeAnn typeAnn = (TypeAnn) expr.getAnn(TypeAnn.class);
       CarrierSet visitor = new CarrierSet();
       Term expr2 = (Term) typeAnn.getType().accept(visitor);
