ci_scripts/test/mutation_testing/patches/rules_src_main_java_net_sourceforge_czt_rules_prover_SimpleProver.patch
--- rules/src/main/java/net/sourceforge/czt/rules/prover/SimpleProver.java	2022-08-14 15:39:46.615277800 +1000
+++ ci_scripts/test/mutation_testing/patches/rules_src_main_java_net_sourceforge_czt_rules_prover_SimpleProver.txt	2022-08-19 18:00:24.260063000 +1000
@@ -137,7 +137,7 @@
               + ", children=" + ruleAppl.getSequentList().size();
             getLogger().fine(message);
             int problem = prove(ruleAppl.getSequentList());
-            if (problem < 0) {
+            if (problem > 0) {
               message = "Finished rule " + rulePara.getName() + "." + id;
               getLogger().fine(message);
               return true;
