ci_scripts/test/mutation_testing/patches/rules_src_main_java_net_sourceforge_czt_rules_rewriter_RewriteVisitor.patch
--- rules/src/main/java/net/sourceforge/czt/rules/rewriter/RewriteVisitor.java	2022-08-13 13:35:54.167757900 +1000
+++ ci_scripts/test/mutation_testing/patches/rules_src_main_java_net_sourceforge_czt_rules_rewriter_RewriteVisitor.txt	2022-08-19 18:00:20.370063000 +1000
@@ -103,7 +103,7 @@
           Expr left = memPred.getLeftExpr();
           if (memPred.getRightExpr() instanceof SetExpr) {
             SetExpr set = (SetExpr) memPred.getRightExpr();
-            if (set.getZExprList().size() == 1) {
+            if (set.getZExprList().size() != 1) {
               Expr right = set.getZExprList().get(0);
               RewriteRule rewriteRule =
                 new RewriteRule(rule.getName(), left, right,
