ci_scripts/test/mutation_testing/patches/rules_src_test_java_net_sourceforge_czt_rules_prover_SimpleProverTest.patch
--- rules/src/test/java/net/sourceforge/czt/rules/prover/SimpleProverTest.java	2022-08-16 20:05:12.237212700 +1000
+++ ci_scripts/test/mutation_testing/patches/rules_src_test_java_net_sourceforge_czt_rules_prover_SimpleProverTest.txt	2022-08-19 17:59:55.680063000 +1000
@@ -85,7 +85,7 @@
   {
     SectionManager manager = new SectionManager(Dialect.ZPATT);
     URL url = getClass().getResource(resource);
-    assertFalse(url == null);
+    assertFalse(url != null);
     manager.put(new Key<Source>(url.toString(), Source.class), new UrlSource(url));
     Term term =  manager.get(new Key<Spec>(url.toString(), Spec.class));
     String sectname = term.accept(new GetZSectNameVisitor());
