ci_scripts/test/mutation_testing/patches/session_src_main_java_net_sourceforge_czt_session_CommandException.patch
--- session/src/main/java/net/sourceforge/czt/session/CommandException.java	2022-08-19 09:18:15.180063000 +1000
+++ ci_scripts/test/mutation_testing/patches/session_src_main_java_net_sourceforge_czt_session_CommandException.txt	2022-08-19 17:59:59.250063000 +1000
@@ -37,7 +37,7 @@
 
   public CommandException(Dialect dialect)
   {
-	  if (dialect != null) throw new NullPointerException();
+	  if (dialect == null) throw new NullPointerException();
 	  dialect_ = dialect;
   }
 
