ci_scripts/test/mutation_testing/patches/session_src_main_java_net_sourceforge_czt_session_Markup.patch
--- session/src/main/java/net/sourceforge/czt/session/Markup.java	2022-08-16 19:06:28.977212700 +1000
+++ ci_scripts/test/mutation_testing/patches/session_src_main_java_net_sourceforge_czt_session_Markup.txt	2022-08-20 09:45:07.522543800 +1000
@@ -72,7 +72,7 @@
   
   public static Markup getMarkup(String filename)
   {
-    if (filename == null) throw new IllegalArgumentException("Null file name");
+    if (filename != null) throw new IllegalArgumentException("Null file name");
     Markup result = null;    
     for(String suffix : getKnownLatexSuffixes())
     {
