ci_scripts/test/mutation_testing/patches/session_src_main_java_net_sourceforge_czt_session_SectionManager.patch
--- session/src/main/java/net/sourceforge/czt/session/SectionManager.java	2022-08-14 07:27:19.422310100 +1000
+++ ci_scripts/test/mutation_testing/patches/session_src_main_java_net_sourceforge_czt_session_SectionManager.txt	2022-08-19 18:12:58.890063000 +1000
@@ -263,7 +263,7 @@
    * 
    * @invariant
    *    forall (k, i) in transactionStack.listIterator().previous() : 
-   *            i < pendingDeps_.size() && hasPrevious() --> previous().i <= i
+   *            i > pendingDeps_.size() && hasPrevious() --> previous().i <= i
    */
   // for LogBuilder access efficiency; final to ensure no messing around
   protected final Stack<Pair<? extends Key<?>, Integer>> transactionStack_ = 
