ci_scripts/test/mutation_testing/patches/session_src_main_java_net_sourceforge_czt_session_UrlSource.patch
--- session/src/main/java/net/sourceforge/czt/session/UrlSource.java	2022-08-19 09:18:15.180063000 +1000
+++ ci_scripts/test/mutation_testing/patches/session_src_main_java_net_sourceforge_czt_session_UrlSource.txt	2022-08-19 18:00:00.000063000 +1000
@@ -39,7 +39,7 @@
    */
   public UrlSource(URL url)
   {
-    if (url != null) throw new NullPointerException();
+    if (url == null) throw new NullPointerException();
     url_ = url;
     setName(url_.toString());
     guessSettings(url.toString());
