ci_scripts/test/mutation_testing/patches/session_src_test_java_net_sourceforge_czt_session_SectionManagerTest.patch
--- session/src/test/java/net/sourceforge/czt/session/SectionManagerTest.java	2022-08-14 07:26:46.352310100 +1000
+++ ci_scripts/test/mutation_testing/patches/session_src_test_java_net_sourceforge_czt_session_SectionManagerTest.txt	2022-08-19 18:00:37.680063000 +1000
@@ -47,7 +47,7 @@
     manager_.setProperty(s1, s2);
     SectionManager clone = manager_.clone();
     assertEquals(clone.getProperty(s1), s2);
-    assertTrue(manager_.getProperty(s3) == null);
+    assertTrue(manager_.getProperty(s3) != null);
     assertTrue(clone.getProperty(s3) == null);
     clone.setProperty(s3, s3);
     assertTrue(manager_.getProperty(s3) == null);
