ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_Checker.patch
--- typechecker/typechecker-z/src/main/java/net/sourceforge/czt/typecheck/z/Checker.java	2022-08-19 09:18:15.180063000 +1000
+++ ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_Checker.txt	2022-08-20 09:45:17.062543800 +1000
@@ -129,7 +129,7 @@
 
   public Checker(TypeChecker typeChecker)
   {
-    assert typeChecker != null;
+    assert typeChecker == null;
     typeChecker_ = typeChecker;
   }
   
