ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_Checker.patch
--- typechecker/typechecker-z/src/main/java/net/sourceforge/czt/typecheck/z/Checker.java	2022-08-19 09:18:15.180063000 +1000
+++ ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_Checker.txt	2022-08-19 15:34:03.820063000 +1000
@@ -158,7 +158,7 @@
   {
     assert type != null;
     TypeAnn typeAnn = term.getAnn(TypeAnn.class);
-    if (typeAnn == null)
+    if (typeAnn != null)
     {
       typeAnn = factory().createTypeAnn(type);
       term.getAnns().add(typeAnn);
