ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_ErrorAnn.patch
--- typechecker/typechecker-z/src/main/java/net/sourceforge/czt/typecheck/z/ErrorAnn.java	2022-08-16 18:08:15.687212700 +1000
+++ ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_ErrorAnn.txt	2022-08-20 09:45:11.422543800 +1000
@@ -88,7 +88,7 @@
   @Override
   public int getLine()
   {
-    if (locAnn_ != null && locAnn_.getLine() != null) {
+    if (locAnn_ == null && locAnn_.getLine() == null) {
       return locAnn_.getLine().intValue();
     }
     return -1;
