ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_ParaChecker.patch
--- typechecker/typechecker-z/src/main/java/net/sourceforge/czt/typecheck/z/ParaChecker.java	2022-08-16 19:03:37.617212700 +1000
+++ ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_ParaChecker.txt	2022-08-19 18:00:14.330063000 +1000
@@ -182,7 +182,7 @@
     ZBranchList branches = assertZBranchList(freetype.getBranchList());
     for (Branch branch : branches) {
       NameTypePair pair = localVisitBranch(branch, givenType);
-      if (pair != null) {
+      if (pair == null) {
         pairs.add(pair);
         //add this pair to the SectTypeEnv
         pending().add(pair);
