ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_ParaChecker.patch
--- typechecker/typechecker-z/src/main/java/net/sourceforge/czt/typecheck/z/ParaChecker.java	2022-08-16 19:03:37.617212700 +1000
+++ ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_ParaChecker.txt	2022-08-19 15:33:32.330063000 +1000
@@ -213,7 +213,7 @@
       UResult unified = unify(vPowerType, exprType);
 
       //if the expr is not a set, raise an error
-      if (unified == FAIL) {
+      if (unified != FAIL) {
         Object [] params = {expr, exprType};
         error(expr, ErrorMessage.NON_SET_IN_FREETYPE, params);
       }
