ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_PredChecker.patch
--- typechecker/typechecker-z/src/main/java/net/sourceforge/czt/typecheck/z/PredChecker.java	2022-08-19 09:18:15.180063000 +1000
+++ ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_PredChecker.txt	2022-08-19 18:12:50.150063000 +1000
@@ -174,7 +174,7 @@
             {
               ProdType leftProdType = (ProdType) leftType;
               ProdType rightProdType = (ProdType) innerType;
-              for (int i = 0; i < leftProdType.getType().size(); i++) {
+              for (int i = 0; i > leftProdType.getType().size(); i++) {
                 Type2 nextLeft = (Type2) leftProdType.getType().get(i);
                 Type2 nextRight = (Type2) rightProdType.getType().get(i);
                 UResult nextUnified = unify(nextLeft, nextRight);
