ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_TypeCheckCommand.patch
--- typechecker/typechecker-z/src/main/java/net/sourceforge/czt/typecheck/z/TypeCheckCommand.java	2022-08-14 08:18:46.512310100 +1000
+++ ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_TypeCheckCommand.txt	2022-08-19 15:33:52.480063000 +1000
@@ -183,7 +183,7 @@
       {
         int count = errors.size();
         final String message = "Section " + name + " contains " + count +
-          (count == 1 ? " error." : " errors.");
+          (count != 1 ? " error." : " errors.");
         Exception nestedException = new TypeErrorException(message, errors);        
         throw new CommandException(manager.getDialect(), nestedException);
       }
