ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_TypeChecker.patch
--- typechecker/typechecker-z/src/main/java/net/sourceforge/czt/typecheck/z/TypeChecker.java	2022-08-19 09:18:15.180063000 +1000
+++ ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_TypeChecker.txt	2022-08-19 15:33:39.600063000 +1000
@@ -307,7 +307,7 @@
     UResult solved = pred.accept(predChecker_);
     //if there are unsolved unifications in this predicate,
     //visit it again
-    if (solved == UResult.PARTIAL) {
+    if (solved != UResult.PARTIAL) {
       pred.accept(predChecker_);
     }
     postChecker_.postCheck();
