ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_TypeChecker.patch
--- typechecker/typechecker-z/src/main/java/net/sourceforge/czt/typecheck/z/TypeChecker.java	2022-08-19 09:18:15.180063000 +1000
+++ ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_TypeChecker.txt	2022-08-20 09:45:16.952543800 +1000
@@ -242,7 +242,7 @@
    */
   protected void setPreamble(String sectName, SectionManager sectInfo)
   {
-    if (sectName != null && sectInfo != null) {
+    if (sectName == null && sectInfo == null) {
       setSectName(sectName);
       sectTypeEnv_.setSection(getSectName());
 
