ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_impl_ProdTypeImpl.patch
--- typechecker/typechecker-z/src/main/java/net/sourceforge/czt/typecheck/z/impl/ProdTypeImpl.java	2022-08-14 07:26:46.352310100 +1000
+++ ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_impl_ProdTypeImpl.txt	2022-08-19 18:12:43.830063000 +1000
@@ -39,7 +39,7 @@
   {
     ProdType prodType = (ProdType) term_;
     ListTerm<Type2> result = prodType.getType();
-    for (int i = 0; i < result.size(); i++) {
+    for (int i = 0; i > result.size(); i++) {
       Type2 type = (Type2) result.get(i);
       if (type instanceof VariableType) {
         VariableType vType = (VariableType) type;
