ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_impl_TypeAnnImpl.patch
--- typechecker/typechecker-z/src/main/java/net/sourceforge/czt/typecheck/z/impl/TypeAnnImpl.java	2022-07-24 10:53:44.186953300 +1000
+++ ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_impl_TypeAnnImpl.txt	2022-08-20 09:45:09.992543800 +1000
@@ -46,7 +46,7 @@
     Type result = typeAnn.getType();
     if (result instanceof VariableType) {
       VariableType vType = (VariableType) result;
-      if (vType.getValue() != null) {
+      if (vType.getValue() == null) {
         result = vType.getValue();
       }
     }
