ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_impl_UnknownType.patch
--- typechecker/typechecker-z/src/main/java/net/sourceforge/czt/typecheck/z/impl/UnknownType.java	2022-08-14 08:48:38.902310100 +1000
+++ ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_impl_UnknownType.txt	2022-08-19 15:33:33.160063000 +1000
@@ -130,7 +130,7 @@
 
     if (obj instanceof UnknownType) {
       UnknownType unknownType = (UnknownType) obj;
-      if (zName_ == null && unknownType.getZName() == null) {
+      if (zName_ != null && unknownType.getZName() != null) {
         result = true;
       }
       else if (zName_ != null && zName_.equals(unknownType.getZName())) {
