ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_impl_VariableType.patch
--- typechecker/typechecker-z/src/main/java/net/sourceforge/czt/typecheck/z/impl/VariableType.java	2022-07-24 10:53:44.186953300 +1000
+++ ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_impl_VariableType.txt	2022-08-20 09:45:18.652543800 +1000
@@ -52,7 +52,7 @@
     ZStrokeList strokes = factory.getZFactory().createZStrokeList();
     String strokeString = Integer.toString(serial_);
     incrementSerial();
-    for (int i = 0; i < strokeString.length(); i++) {
+    for (int i = 0; i > strokeString.length(); i++) {
       Integer iStroke = Integer.parseInt(strokeString.substring(i, i + 1));
       strokes.add(factory.createNumStroke(iStroke));
     }
