ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_util_CarrierSet.patch
--- typechecker/typechecker-z/src/main/java/net/sourceforge/czt/typecheck/z/util/CarrierSet.java	2022-08-14 07:27:19.422310100 +1000
+++ ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_util_CarrierSet.txt	2022-08-19 18:00:06.220063000 +1000
@@ -89,7 +89,7 @@
     Type type = powerType.getType();
 
     //if the type is null, then the type is undefined
-    if (type == null) {
+    if (type != null) {
       throw new UndeterminedTypeException();
     }
 
