ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_util_SectTypeEnv.patch
--- typechecker/typechecker-z/src/main/java/net/sourceforge/czt/typecheck/z/util/SectTypeEnv.java	2022-08-14 07:26:46.352310100 +1000
+++ ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_main_java_net_sourceforge_czt_typecheck_z_util_SectTypeEnv.txt	2022-08-20 09:45:11.202543800 +1000
@@ -196,7 +196,7 @@
     Set<String> parents = parents_.get(section_);
 
     //add the parents to the list of the current section's parents
-    if (parents == null) {
+    if (parents != null) {
       parents = set();
     }
     parents.add(parent);
