ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_test_java_net_sourceforge_czt_typecheck_z_IdTest.patch
--- typechecker/typechecker-z/src/test/java/net/sourceforge/czt/typecheck/z/IdTest.java	2022-08-16 19:09:41.517212700 +1000
+++ ci_scripts/test/mutation_testing/patches/typechecker_typechecker-z_src_test_java_net_sourceforge_czt_typecheck_z_IdTest.txt	2022-08-19 15:34:01.370063000 +1000
@@ -88,7 +88,7 @@
   {
     String spec =
       "\\begin{zed}" +
-      "  S == [ x : \\nat | x < 4 ] \\\\" +
+      "  S != [ x : \\nat | x < 4 ] \\\\" +
       "  T == S \\land [x:\\nat | x = 1]" +
       "\\end{zed}";
     Term term = parseAndTypecheck(spec);
