ci_scripts/test/mutation_testing/patches/ui_src_main_java_net_sourceforge_czt_ui_Main.patch
--- ui/src/main/java/net/sourceforge/czt/ui/Main.java	2022-08-14 07:27:19.422310100 +1000
+++ ci_scripts/test/mutation_testing/patches/ui_src_main_java_net_sourceforge_czt_ui_Main.txt	2022-08-19 18:12:52.640063000 +1000
@@ -107,7 +107,7 @@
       if (e.getCause() != null)
       {
         if (e.getCause().getMessage() != null
-            && verbosityLevel_.intValue() >= Level.INFO.intValue())
+            && verbosityLevel_.intValue() < Level.INFO.intValue())
         {
           System.err.println(e.getCause().getMessage());
           return;
