ci_scripts/test/mutation_testing/patches/util_src_main_java_net_sourceforge_czt_base_impl_TermImpl.patch
--- util/src/main/java/net/sourceforge/czt/base/impl/TermImpl.java	2022-08-19 18:18:52.990063000 +1000
+++ ci_scripts/test/mutation_testing/patches/util_src_main_java_net_sourceforge_czt_base_impl_TermImpl.txt	2022-08-20 09:45:10.362543800 +1000
@@ -73,7 +73,7 @@
   @Override
   public boolean equals(Object obj)
   {
-    if (obj != null && this.getClass().equals(obj.getClass())) {
+    if (obj == null && this.getClass().equals(obj.getClass())) {
       return true;
     }
     return false;
