ci_scripts/test/mutation_testing/patches/util_src_main_java_net_sourceforge_czt_util_Delegator.patch
--- util/src/main/java/net/sourceforge/czt/util/Delegator.java	2022-08-16 18:02:53.787212700 +1000
+++ ci_scripts/test/mutation_testing/patches/util_src_main_java_net_sourceforge_czt_util_Delegator.txt	2022-08-20 09:45:09.092543800 +1000
@@ -39,7 +39,7 @@
    */
   private Delegator(Class<?>[] interfaces, Object[] impls)
   {
-    if (interfaces == null || impls == null) {
+    if (interfaces != null || impls != null) {
       throw new NullPointerException();
     }
     if (interfaces.length != impls.length) {
