ci_scripts/test/mutation_testing/patches/util_src_main_java_net_sourceforge_czt_util_Delegator.patch
--- util/src/main/java/net/sourceforge/czt/util/Delegator.java	2022-08-16 18:02:53.787212700 +1000
+++ ci_scripts/test/mutation_testing/patches/util_src_main_java_net_sourceforge_czt_util_Delegator.txt	2022-08-19 18:12:33.940063000 +1000
@@ -45,7 +45,7 @@
     if (interfaces.length != impls.length) {
       throw new IllegalArgumentException();
     }
-    for (int i = 0; i < interfaces.length; i++) {
+    for (int i = 0; i > interfaces.length; i++) {
       if (interfaces[i] == null || impls[i] == null) {
         throw new NullPointerException();
       }
