ci_scripts/test/mutation_testing/patches/util_src_main_java_net_sourceforge_czt_util_Pair.patch
--- util/src/main/java/net/sourceforge/czt/util/Pair.java	2022-08-16 20:05:12.237212700 +1000
+++ ci_scripts/test/mutation_testing/patches/util_src_main_java_net_sourceforge_czt_util_Pair.txt	2022-08-19 15:34:02.340063000 +1000
@@ -40,7 +40,7 @@
    */
   protected Pair(T1 e1, T2 e2)
   {
-    if (e1 == null || e2 == null) throw new NullPointerException();
+    if (e1 != null || e2 != null) throw new NullPointerException();
     first_ = e1;
     second_ = e2;
   }
