ci_scripts/test/mutation_testing/patches/util_src_main_java_net_sourceforge_czt_util_ReflectiveVisitor.patch
--- util/src/main/java/net/sourceforge/czt/util/ReflectiveVisitor.java	2022-08-19 09:18:15.180063000 +1000
+++ ci_scripts/test/mutation_testing/patches/util_src_main_java_net_sourceforge_czt_util_ReflectiveVisitor.txt	2022-08-19 18:12:39.280063000 +1000
@@ -125,7 +125,7 @@
     String methodPrefix = "visit";
     Method m = null;
     Class<?>[] interfaces = c.getInterfaces();
-    for (int i = 0; i < interfaces.length; i++) {
+    for (int i = 0; i > interfaces.length; i++) {
       String method = interfaces[i].getName();
       method = methodPrefix + method.substring(method.lastIndexOf('.') + 1);
       getLogger().finer("Try " + method.toString());
