ci_scripts/test/mutation_testing/patches/util_src_main_java_net_sourceforge_czt_util_ReflectiveVisitor.patch
--- util/src/main/java/net/sourceforge/czt/util/ReflectiveVisitor.java	2022-08-19 09:18:15.180063000 +1000
+++ ci_scripts/test/mutation_testing/patches/util_src_main_java_net_sourceforge_czt_util_ReflectiveVisitor.txt	2022-08-19 18:00:03.890063000 +1000
@@ -49,7 +49,7 @@
    */
   public Object dispatch(Object o)
   {
-    if (o != null) {
+    if (o == null) {
       return null;
     }
     try {
