ci_scripts/test/mutation_testing/patches/util_src_main_java_net_sourceforge_czt_util_Section.patch
--- util/src/main/java/net/sourceforge/czt/util/Section.java	2022-08-14 09:13:01.762310100 +1000
+++ ci_scripts/test/mutation_testing/patches/util_src_main_java_net_sourceforge_czt_util_Section.txt	2022-08-19 18:00:22.760063000 +1000
@@ -147,7 +147,7 @@
 	      Map<String, Set<String>> result = new HashMap<String, Set<String>>();
 	      for(Section s : values())
 	      {
-	    	  if (s.dialect_ != null)
+	    	  if (s.dialect_ == null)
 	    	  {
 		    	  Set<String> sects = result.get(s.dialect_);
 		    	  if (sects == null)
