ci_scripts/test/mutation_testing/patches/util_src_main_java_net_sourceforge_czt_util_Section.patch
--- util/src/main/java/net/sourceforge/czt/util/Section.java	2022-08-14 09:13:01.762310100 +1000
+++ ci_scripts/test/mutation_testing/patches/util_src_main_java_net_sourceforge_czt_util_Section.txt	2022-08-19 15:33:41.510063000 +1000
@@ -150,7 +150,7 @@
 	    	  if (s.dialect_ != null)
 	    	  {
 		    	  Set<String> sects = result.get(s.dialect_);
-		    	  if (sects == null)
+		    	  if (sects != null)
 		    	  {
 		    		  sects = new HashSet<String>();
 		    		  result.put(s.dialect_, sects);
