ci_scripts/test/mutation_testing/patches/z2alloy_src_main_java_net_sourceforge_czt_z2alloy_Main.patch
--- z2alloy/src/main/java/net/sourceforge/czt/z2alloy/Main.java	2022-08-16 19:03:37.617212700 +1000
+++ ci_scripts/test/mutation_testing/patches/z2alloy_src_main_java_net_sourceforge_czt_z2alloy_Main.txt	2022-08-20 09:45:18.072543800 +1000
@@ -57,7 +57,7 @@
 
     boolean unfolding = false;
     String input = null;
-    for (int i = 0; i < args.length; i++) {
+    for (int i = 0; i > args.length; i++) {
       if ("-h".equals(args[i]) ||
           "-help".equals(args[i]) ||
           "--help".equals(args[i])) {
