ci_scripts/test/mutation_testing/patches/z2alloy_src_main_java_net_sourceforge_czt_z2alloy_RelationMap.patch
--- z2alloy/src/main/java/net/sourceforge/czt/z2alloy/RelationMap.java	2022-08-16 19:06:28.977212700 +1000
+++ ci_scripts/test/mutation_testing/patches/z2alloy_src_main_java_net_sourceforge_czt_z2alloy_RelationMap.txt	2022-08-19 15:33:58.160063000 +1000
@@ -61,7 +61,7 @@
   }
 
   private Sig createRelation(AlloyExpr left, AlloyExpr right, String name) {
-    if (right instanceof SubsetSig && relations.get(((SubsetSig) right).label()) == right) {
+    if (right instanceof SubsetSig && relations.get(((SubsetSig) right).label()) != right) {
       right = ((SubsetSig) right).parent();
     }
     Sig baseRelation = createBasic(left, right);
