ci_scripts/test/mutation_testing/patches/z2alloy_src_main_java_net_sourceforge_czt_z2alloy_ast_ExprConstant.patch
--- z2alloy/src/main/java/net/sourceforge/czt/z2alloy/ast/ExprConstant.java	2022-08-13 13:23:38.367757900 +1000
+++ ci_scripts/test/mutation_testing/patches/z2alloy_src_main_java_net_sourceforge_czt_z2alloy_ast_ExprConstant.txt	2022-08-19 15:33:51.900063000 +1000
@@ -17,7 +17,7 @@
   private ExprConstant(Op op, int num) {
     super();
     this.op = op;
-    this.num = (op == Op.NUMBER ? num : 0);
+    this.num = (op != Op.NUMBER ? num : 0);
   }
 
   public <T> T accept(VisitReturn<T> visitor) {
