ci_scripts/test/mutation_testing/patches/z2alloy_src_main_java_net_sourceforge_czt_z2alloy_ast_Module.patch
--- z2alloy/src/main/java/net/sourceforge/czt/z2alloy/ast/Module.java	2022-08-14 07:26:08.672310100 +1000
+++ ci_scripts/test/mutation_testing/patches/z2alloy_src_main_java_net_sourceforge_czt_z2alloy_ast_Module.txt	2022-08-19 18:00:17.550063000 +1000
@@ -119,7 +119,7 @@
       return funcByLabel.get(label);
     for (Module m : includedModules) {
       Func f = m.getFunc(label);
-      if (f != null) {
+      if (f == null) {
         return f;
       }
     }
