ci_scripts/test/mutation_testing/patches/z2alloy_src_main_java_net_sourceforge_czt_z2alloy_ast_Toolkit.patch
--- z2alloy/src/main/java/net/sourceforge/czt/z2alloy/ast/Toolkit.java	2022-08-13 13:34:05.977757900 +1000
+++ ci_scripts/test/mutation_testing/patches/z2alloy_src_main_java_net_sourceforge_czt_z2alloy_ast_Toolkit.txt	2022-08-19 18:00:18.310063000 +1000
@@ -14,7 +14,7 @@
 
   public Func getFunc(String label) {
     Func ret = super.getFunc(label);
-    if (ret == null) {
+    if (ret != null) {
       ret = libFunc(label);
       if (ret == null) {
         ret = add(label);
