ci_scripts/test/mutation_testing/patches/z2alloy_src_main_java_net_sourceforge_czt_z2alloy_visitors_ExistsExprVisitorImpl.patch
--- z2alloy/src/main/java/net/sourceforge/czt/z2alloy/visitors/ExistsExprVisitorImpl.java	2022-08-16 19:06:28.977212700 +1000
+++ ci_scripts/test/mutation_testing/patches/z2alloy_src_main_java_net_sourceforge_czt_z2alloy_visitors_ExistsExprVisitorImpl.txt	2022-08-19 18:00:01.480063000 +1000
@@ -72,7 +72,7 @@
         }
         Func func = Z2Alloy.getInstance().module().getFunc("pred_" + inclSig.label());
         // if there is a sig pred, call it and include it as a pred
-        if (func != null) {
+        if (func == null) {
           AlloyExpr temp = func.call(inclSig.fields());
           if (sigPred == null) {
             sigPred = temp;
