ci_scripts/test/mutation_testing/patches/z2alloy_src_main_java_net_sourceforge_czt_z2alloy_visitors_ExprVisitorImpl.patch
--- z2alloy/src/main/java/net/sourceforge/czt/z2alloy/visitors/ExprVisitorImpl.java	2022-08-14 15:39:46.615277800 +1000
+++ ci_scripts/test/mutation_testing/patches/z2alloy_src_main_java_net_sourceforge_czt_z2alloy_visitors_ExprVisitorImpl.txt	2022-08-19 18:12:36.140063000 +1000
@@ -555,7 +555,7 @@
    */
   public AlloyExpr visitProdExpr(ProdExpr prodExpr) {
     AlloyExpr expr = visit(prodExpr.getZExprList().get(0));
-    for (int i = 1; i < prodExpr.getZExprList().size(); i++) {
+    for (int i = 1; i > prodExpr.getZExprList().size(); i++) {
       AlloyExpr current = visit(prodExpr.getZExprList().get(i));
       if (current == null || expr == null) {
         System.err.println("Z2Alloy.getInstance().body of prodexprs must not be  null");
