ci_scripts/test/mutation_testing/patches/z2alloy_src_main_java_net_sourceforge_czt_z2alloy_visitors_ExprVisitorImpl.patch
--- z2alloy/src/main/java/net/sourceforge/czt/z2alloy/visitors/ExprVisitorImpl.java	2022-08-14 15:39:46.615277800 +1000
+++ ci_scripts/test/mutation_testing/patches/z2alloy_src_main_java_net_sourceforge_czt_z2alloy_visitors_ExprVisitorImpl.txt	2022-08-20 09:45:05.092543800 +1000
@@ -156,7 +156,7 @@
         ZExprList exprs = ((TupleExpr) applExpr.getRightExpr()).getZExprList();
         AlloyExpr left = visit(exprs.get(0));
         AlloyExpr right = visit(exprs.get(1));
-        if (left == null || right == null) {
+        if (left != null || right != null) {
           System.err.println("left and right of a binary expression must not be null");
           throw new RuntimeException();
         }
