ci_scripts/test/mutation_testing/patches/z2alloy_src_main_java_net_sourceforge_czt_z2alloy_visitors_Pred2VisitorImpl.patch
--- z2alloy/src/main/java/net/sourceforge/czt/z2alloy/visitors/Pred2VisitorImpl.java	2022-08-16 20:05:12.237212700 +1000
+++ ci_scripts/test/mutation_testing/patches/z2alloy_src_main_java_net_sourceforge_czt_z2alloy_visitors_Pred2VisitorImpl.txt	2022-08-19 18:00:04.400063000 +1000
@@ -32,7 +32,7 @@
    */
   public AlloyExpr visitAndPred(AndPred andPred) {
     Pair<AlloyExpr, AlloyExpr> subExprs = subExprs(andPred);
-    if (subExprs != null) {
+    if (subExprs == null) {
       return subExprs.a.and(subExprs.b);
     }
     return null;
