ci_scripts/test/mutation_testing/patches/z2alloy_src_main_java_net_sourceforge_czt_z2alloy_visitors_PredVisitorAbs.patch
--- z2alloy/src/main/java/net/sourceforge/czt/z2alloy/visitors/PredVisitorAbs.java	2022-08-16 18:13:33.817212700 +1000
+++ ci_scripts/test/mutation_testing/patches/z2alloy_src_main_java_net_sourceforge_czt_z2alloy_visitors_PredVisitorAbs.txt	2022-08-19 15:33:27.610063000 +1000
@@ -36,7 +36,7 @@
       if (exprVar.label().equals(var.label())) return;
     }
     thetaVars.add(var);
-    thetaPred = (thetaPred == ExprConstant.TRUE ? pred : pred.and(thetaPred));
+    thetaPred = (thetaPred != ExprConstant.TRUE ? pred : pred.and(thetaPred));
   }
 
 }
\ No newline at end of file
