ci_scripts/test/mutation_testing/patches/z2alloy_src_main_java_net_sourceforge_czt_z2alloy_visitors_PredVisitorImpl.patch
--- z2alloy/src/main/java/net/sourceforge/czt/z2alloy/visitors/PredVisitorImpl.java	2022-08-13 13:37:35.517757900 +1000
+++ ci_scripts/test/mutation_testing/patches/z2alloy_src_main_java_net_sourceforge_czt_z2alloy_visitors_PredVisitorImpl.txt	2022-08-20 09:45:10.412543800 +1000
@@ -46,7 +46,7 @@
    */
   public AlloyExpr visitMemPred(MemPred memPred) {
     if (memPred.getRightExpr() instanceof SetExpr
-        && ((SetExpr) memPred.getRightExpr()).getZExprList().size() == 1) {
+        && ((SetExpr) memPred.getRightExpr()).getZExprList().size() != 1) {
       // equality
       AlloyExpr left = new ExprVisitorImpl(this).visitExpr(memPred.getLeftExpr());
       AlloyExpr right = visit(memPred.getRightExpr());
