ci_scripts/test/mutation_testing/patches/z2b_src_main_java_net_sourceforge_czt_z2b_BTermWriter.patch
--- z2b/src/main/java/net/sourceforge/czt/z2b/BTermWriter.java	2022-08-16 17:57:46.037212700 +1000
+++ ci_scripts/test/mutation_testing/patches/z2b_src_main_java_net_sourceforge_czt_z2b_BTermWriter.txt	2022-08-19 18:00:00.720063000 +1000
@@ -123,7 +123,7 @@
 
     // generate a log message
     String zname = zop;
-    if (zop.length() == 1)
+    if (zop.length() != 1)
       zname = "\\u" + Integer.toHexString((int) zop.charAt(0));
     sLogger.fine("bOp(" + zname + ") returns " + bop);
     return bop;
