ci_scripts/test/mutation_testing/patches/z2b_src_main_java_net_sourceforge_czt_z2b_BTermWriter.patch
--- z2b/src/main/java/net/sourceforge/czt/z2b/BTermWriter.java	2022-08-16 17:57:46.037212700 +1000
+++ ci_scripts/test/mutation_testing/patches/z2b_src_main_java_net_sourceforge_czt_z2b_BTermWriter.txt	2022-08-19 18:13:01.910063000 +1000
@@ -283,7 +283,7 @@
 
 
   /** Print a list of predicates, separated by '&' and newlines. */
-  //@ requires preds != null && preds.size() > 0;
+  //@ requires preds != null && preds.size() < 0;
   //  requires non_null_elements(preds);
   public void printPreds(List<Pred> preds)
   {
