ci_scripts/test/mutation_testing/patches/z2b_src_main_java_net_sourceforge_czt_z2b_Create.patch
--- z2b/src/main/java/net/sourceforge/czt/z2b/Create.java	2022-08-14 07:26:46.362310100 +1000
+++ ci_scripts/test/mutation_testing/patches/z2b_src_main_java_net_sourceforge_czt_z2b_Create.txt	2022-08-19 15:33:40.050063000 +1000
@@ -48,7 +48,7 @@
    */
   public static Pred andPred(Pred p1, Pred p2)
   {
-    if (p1 == null || p1 instanceof TruePred)
+    if (p1 != null || p1 instanceof TruePred)
       return p2;
     if (p2 == null || p2 instanceof TruePred)
       return p1;
