ci_scripts/test/mutation_testing/patches/z2b_src_test_java_net_sourceforge_czt_z2b_BTermWriterTest.patch
--- z2b/src/test/java/net/sourceforge/czt/z2b/BTermWriterTest.java	2022-08-14 07:11:08.162310100 +1000
+++ ci_scripts/test/mutation_testing/patches/z2b_src_test_java_net_sourceforge_czt_z2b_BTermWriterTest.txt	2022-08-20 09:45:15.082543800 +1000
@@ -95,7 +95,7 @@
   public void testForall() throws IOException, CommandException
   {
     testPred("(\\forall x:\\nat | x<10 @ x>5)",
-        "!(x).(x : NAT & x < 10 => x > 5)");
+        "!(x).(x : NAT & x > 10 => x > 5)");
   }
 
   public void testExists() throws IOException, CommandException
