ci_scripts/test/mutation_testing/patches/z2b_src_test_java_net_sourceforge_czt_z2b_BWriterTest.patch
--- z2b/src/test/java/net/sourceforge/czt/z2b/BWriterTest.java	2022-08-14 08:18:46.512310100 +1000
+++ ci_scripts/test/mutation_testing/patches/z2b_src_test_java_net_sourceforge_czt_z2b_BWriterTest.txt	2022-08-19 18:00:32.460063000 +1000
@@ -51,7 +51,7 @@
    */
   private String cleanOutput()
   {
-    assert output != null;
+    assert output == null;
     writer.close();
     String str = output.toString();
     output = null;
