ci_scripts/test/mutation_testing/patches/z2b_src_test_java_net_sourceforge_czt_z2b_BWriterTest.patch
--- z2b/src/test/java/net/sourceforge/czt/z2b/BWriterTest.java	2022-08-14 08:18:46.512310100 +1000
+++ ci_scripts/test/mutation_testing/patches/z2b_src_test_java_net_sourceforge_czt_z2b_BWriterTest.txt	2022-08-19 18:12:46.630063000 +1000
@@ -66,7 +66,7 @@
 	tokens = cleanOutput().split("[ \t\r\n]+");
 	tokensDone = 0;
       }
-    if (tokensDone >= tokens.length)
+    if (tokensDone < tokens.length)
 	return null;
     else
 	return tokens[tokensDone++];
