ci_scripts/test/mutation_testing/patches/z2b_src_test_java_net_sourceforge_czt_z2b_BWriterTest.patch
--- z2b/src/test/java/net/sourceforge/czt/z2b/BWriterTest.java	2022-08-14 08:18:46.512310100 +1000
+++ ci_scripts/test/mutation_testing/patches/z2b_src_test_java_net_sourceforge_czt_z2b_BWriterTest.txt	2022-08-19 15:33:47.530063000 +1000
@@ -61,7 +61,7 @@
   /** Returns the output tokens one at a time. */
   private String nextToken()
   {
-    if (tokens == null)
+    if (tokens != null)
       {
 	tokens = cleanOutput().split("[ \t\r\n]+");
 	tokensDone = 0;
